#!/usr/bin/env python3
# 室内の暑さ指数(WBGT)を求める

import sys

# 室内用のWBGT簡易推定図
# 日本生気象学会：日常生活における熱中症予防指針Ver.4, 2022.5
# https://seikishou.jp/cms/wp-content/uploads/008ab7fdbb0b958314827de9a7b8c74c.pdf
# 上から下へ乾球温度21, 22,..., 40degree,  index 0-19
# 左から右へ相対湿度20, 25,..., 100%RH,    index 0-16
WBGT=[
    [14,14,15,15,16,16,17,17,18,18,19,19,19,20,20,21,21],
    [15,15,16,16,17,17,18,18,19,19,20,20,20,21,21,22,22],
    [15,16,16,17,18,18,19,19,20,20,20,21,21,22,22,23,23],
    [16,17,17,18,18,19,19,20,20,21,21,22,22,23,23,24,24],
    [17,17,18,19,19,20,20,21,21,22,22,23,23,24,24,25,25],
    [18,18,19,20,20,21,21,22,22,23,23,24,24,25,25,26,26],
    [18,19,20,20,21,22,22,23,23,24,24,25,25,26,26,27,27],
    [19,20,21,21,22,22,23,24,24,25,25,26,26,27,27,28,28],
    [20,21,21,22,23,23,24,24,25,26,26,27,27,28,28,29,29],
    [21,21,22,23,23,24,25,25,26,26,27,28,28,29,29,30,30],
    [21,22,23,24,24,25,26,26,27,27,28,29,29,30,30,31,31],
    [22,23,24,24,25,26,26,27,28,28,29,29,30,31,31,32,32],
    [23,24,25,25,26,27,27,28,29,29,30,30,31,31,32,33,33],
    [24,25,25,26,27,28,28,29,30,30,31,31,32,32,33,34,34],
    [24,25,26,27,28,28,29,30,30,31,32,32,33,33,34,34,35],
    [25,26,27,28,29,29,30,31,31,32,33,33,34,34,35,35,36],
    [26,27,28,29,29,30,31,32,32,33,34,34,35,35,36,36,37],
    [27,28,29,29,30,31,32,33,33,34,35,35,36,36,37,37,38],
    [27,28,29,30,31,32,33,33,34,35,35,36,37,37,38,38,39],
    [28,29,30,31,32,33,34,34,35,36,36,37,38,38,39,39,40]
]

# 室内の暑さ指数(WBGT)を求める関数
def wbgt(temp, humid):
    try:
        # 小数点以下を四捨五入
        t = round(float(temp)-21)
        h = round((float(humid)-20)/5)
        # 小数点以下を切り上げ
        # t = math.ceil(float(temp)-21)
        # h = math.ceil((float(humid)-20)/5)
    except ValueError:
        t = 99
    if 0 <= t <= 19 and 0 <= h <= 16:
        wbgt_value = WBGT[t][h]
    else:
        wbgt_value = 99 #温湿度の範囲を外れると99[℃]を返す
    return wbgt_value

# 暑さ指数(WBGT)から基準域を返す関数
def wbgt_range(wbgt_value):
    if wbgt_value == 99:
        # print("Out of range. Should be in 21-40 degree, 20-100 %RH")
        print("暑さ指数は範囲外です(21-40℃,20-100%RH)")
    else:
        range = ""
        if wbgt_value < 25:
            range = "注意"
        if 25 <= wbgt_value < 28:
            range = "警戒"
        if 28 <= wbgt_value < 31:
            range = "厳重警戒"
        if 31 <= wbgt_value:
            range = "危険"
        print("{}レベル(暑さ指数WBGT値{}℃)".format(range, wbgt_value))
    return range

# main()関数
import LINE_Ambient_send
def main(temp, humid):
    # 室内の暑さ指数(WBGT)を求める
    wbgt_value = wbgt(temp, humid)
    # 暑さ指数(WBGT)から基準域を返す
    range = wbgt_range(wbgt_value)
    # Ambient送信
    send_ambient(channelId, writeKey, temp, humid)
    # LINEメッセージ送信
    if 28 <= wbgt_value:
        message = range + "レベル(暑さ指数WBGT値" + wbgt_value + "℃)"
        send_line_message(token, message)


if __name__ == "__main__":
    main()
